Repository: pypi-data/pypi-mirror-36
Catalog: packages/wagtail-podcast/wagtail_podcast-0.1.tar.gz/wagtail_podcast-0.1/wagtail_podcast/locale/*/LC_MESSAGES/django.po
Languages: af

source: Language of podcast
af: Taal van die podcast

source: Language
af: Taal

source: Copyright holder of podcast
af: Kopiereg houer van die podcast

source: Copyright
af: Kopiereg

source: Subtitle of podacst
af: Byskrif van die podcast

source: Subtitle
af: Byskrif

source: Author of podcast
af: Skrywer/Aanbieder van die podcast

source: Author
af: Skrywer/Aanbieder

source: Description of nature of podcast
af: Beskrywing van die podcast

source: Owner of the podcast channel
af: Eienaar van die podcast kanaal

source: Owner name
af: Eienaar se naam

source: Email address of the podcast owner
af: Epos adres van podcast eienaar

source: Owner email
af: Eienaar se epos

source: Image
af: Foto

source: Cover image for podcast
af: Kopireg houer van die podcast

source: Category of the podcast address
af: Kategorie vir die podcast

source: Category
af: Kategorie

source: Main text page that appears on the root page
af: Teks wat op die indeks bladsy verskuin

source: Page Text
af: Bladsy Teks

source: Whether the podcast channel contains explicit content
af: Of daar eksplisiete inhoud op die kanaal voorkom

source: Explicit
af: Eksplisiete Status

source: Podcast Root Page
af: Podcast Vader Bladsy

source: Full
af: Vol

source: Trailer
af: Voorskou

source: Type of episode
af: Tiepe episode

source: Episode Type
af: Episode Tiepe

source: Author of particular podcast
af: Skywer/Aanbieder van hierdie podcast

source: Subtitle of particular podcast
af: Byskrif vir hierdie podcast

source: Description of podcast
af: Beskrywing van die podcast

source: Recording
af: Opname

source: Whether the podcast contains explicit content
af: Of hierdie podcast eksplisiete inhoud bevat

source: Content that accompanies the podcast
af: Teks inhoud wat met die podcast gaan

source: Direct
af: Direk

source: Archive
af: Argief

source: No text available
af: Geen teks beskikbaar nie

source: No description available
af: Geen beskywing beskikbaar nie
