Repository: pypi-data/pypi-mirror-36
Catalog: packages/rer.subsites/rer.subsites-1.4.1.tar.gz/rer.subsites-1.4.1/rer/subsites/locales/*/LC_MESSAGES/rer.subsites.po
Languages: it

source: Enable viewlets
it: Abilita la visualizzazione delle viewlets

source: Set as subsite
it: Imposta come sottosito

source: Set this folder as subsite
it: Abilita questa cartella come sottosito

source: Subsite styles
it: Stili sottositi

source: Subsites settings
it: Impostazioni sottositi

source: Unset as subsite
it: Disabilita come sottosito

source: Unset this folder as subsite
it: Disabilita questa cartella come sottosito

source: error_invalid_css_color
it: Codice colore non valido

source: help_subsite_styles
it: Inserisci una lista di stili css che verranno applicati nel sottosito e nei suoi figli. Se devi utilizzare il colore del sottosito, utilizza la variabile '$color$'.

source: help_subsites_settings_editform
it: Configurazioni sottositi

source: rer_subsites_class
it: Classe del sottosito

source: rer_subsites_class_help
it: Inserisci il nome della classe da associare al sottosito

source: rer_subsites_image
it: Immagine

source: rer_subsites_image_help
it: Inserisci un'immagine per la viewlet con il nome del nome del sottosito.
