Repository: pypi-data/pypi-mirror-36
Catalog: packages/pretix-telephone/pretix-telephone-2.0.0.tar.gz/pretix-telephone-2.0.0/pretix_telephone/locale/*_Informal/LC_MESSAGES/django.po
Languages: de

source: Pretix Phone Number Field
de: pretix Telefonnummernfeld

source: This plugin adds a contact question asking for the telephone number.
de: Dieses Plugin f체gt eine Kontaktfrage hinzu, die nach der Telefonnummer fragt.

source: Phone number
de: Telefonnummer

source: Phone number field
de: Telefonnummern-Feld

source: Contact information
de: Kontaktinformationen

source: Telephone
de: Telefon

source: Telephone field
de: Telefon-Feld

source: Save
de: Speichern

source: Require phone number
de: Telefonnummer erforderlich

source: If this is not checked, entering a phone number is optional.
de: Wenn diese Option nicht aktiv ist, ist die Eingabe einer Telefonnummer freiwillig.

source: Help text
de: Hilfetext

source: This will be shown below the telephone field. You could use it to indicate why you need the number or what you will use it for.
de: Dieser Text wird unter dem Formularfeld f체r die Telefonnummer angezeigt. Du kannst hier z.B. erkl채ren warum du die Nummer brauchst oder wof체r du die Nummer nutzt.
